Results/postgresql/load-unlimited.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /root/ycsb/config/postgresql.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
[...]
Using 1 shards
Using 1 shards
Using 1 shards
[...]
 10 sec: 4090 operations; 407.13 current ops/sec;  
 20 sec: 7128 operations; 303.68 current ops/sec;  
 30 sec: 11583 operations; 445.46 current ops/sec;  
 40 sec: 14789 operations; 320.57 current ops/sec;  
 50 sec: 16988 operations; 219.88 current ops/sec;  
 60 sec: 20799 operations; 381.06 current ops/sec;  
 70 sec: 25081 operations; 428.16 current ops/sec;  
 80 sec: 29013 operations; 393.16 current ops/sec;  
 90 sec: 32279 operations; 326.57 current ops/sec;  
 100 sec: 35444 operations; 316.47 current ops/sec;  
 110 sec: 38761 operations; 331.67 current ops/sec;  
 120 sec: 43027 operations; 426.56 current ops/sec;  
 130 sec: 46740 operations; 371.26 current ops/sec;  
 140 sec: 51977 operations; 523.65 current ops/sec;  
 150 sec: 57207 operations; 522.95 current ops/sec; [INSERT AverageLatency(us)=47293] 
 160 sec: 62387 operations; 517.9 current ops/sec;  
 170 sec: 67217 operations; 482.95 current ops/sec;  
 180 sec: 73097 operations; 587.88 current ops/sec;  
 190 sec: 77643 operations; 454.51 current ops/sec;  
 200 sec: 82539 operations; 489.55 current ops/sec;  
 210 sec: 87936 operations; 539.59 current ops/sec;  
 220 sec: 92886 operations; 494.95 current ops/sec; [INSERT AverageLatency(us)=46620] 
 230 sec: 96558 operations; 367.13 current ops/sec;  
 240 sec: 101884 operations; 532.55 current ops/sec;  
 250 sec: 107458 operations; 557.29 current ops/sec;  
 260 sec: 113090 operations; 563.14 current ops/sec;  
 270 sec: 118110 operations; 501.9 current ops/sec;  
 280 sec: 123739 operations; 562.84 current ops/sec;  
 290 sec: 128408 operations; 466.81 current ops/sec; [INSERT AverageLatency(us)=30461.75] 
 300 sec: 134480 operations; 607.14 current ops/sec;  
 310 sec: 140061 operations; 557.99 current ops/sec;  
 320 sec: 144767 operations; 470.55 current ops/sec;  
 330 sec: 150298 operations; 552.99 current ops/sec; [INSERT AverageLatency(us)=34781] 
 340 sec: 155776 operations; 547.75 current ops/sec;  
 350 sec: 160297 operations; 452.01 current ops/sec; [INSERT AverageLatency(us)=44766] 
 360 sec: 165544 operations; 524.6 current ops/sec;  
 370 sec: 171705 operations; 616.04 current ops/sec;  
 380 sec: 176901 operations; 519.55 current ops/sec;  
 390 sec: 181538 operations; 463.61 current ops/sec;  
 400 sec: 187153 operations; 561.44 current ops/sec;  
 410 sec: 192579 operations; 542.49 current ops/sec;  
 420 sec: 197662 operations; 508.25 current ops/sec;  
 430 sec: 203520 operations; 585.68 current ops/sec;  
 440 sec: 208778 operations; 525.75 current ops/sec;  
 450 sec: 213753 operations; 497.45 current ops/sec;  
 460 sec: 217040 operations; 328.63 current ops/sec;  
 470 sec: 221966 operations; 492.55 current ops/sec;  
 480 sec: 227113 operations; 514.6 current ops/sec;  
 490 sec: 232840 operations; 572.64 current ops/sec;  
 500 sec: 237754 operations; 491.3 current ops/sec;  
 510 sec: 242036 operations; 428.11 current ops/sec; [INSERT AverageLatency(us)=47195.4] 
 520 sec: 247419 operations; 537.92 current ops/sec;  
 530 sec: 252261 operations; 484.1 current ops/sec;  
 540 sec: 256975 operations; 471.35 current ops/sec;  
 550 sec: 262086 operations; 511 current ops/sec;  
 560 sec: 267145 operations; 505.85 current ops/sec;  
 570 sec: 273189 operations; 604.28 current ops/sec;  
 580 sec: 278095 operations; 490.55 current ops/sec;  
 590 sec: 282983 operations; 488.7 current ops/sec;  
 600 sec: 287435 operations; 445.16 current ops/sec;  
 610 sec: 292404 operations; 496.8 current ops/sec;  
 620 sec: 297625 operations; 522.05 current ops/sec;   
 629 sec: 300000 operations; 249.06 current ops/sec;   
[OVERALL], RunTime(ms), 629677.0
[OVERALL], Throughput(ops/sec), 476.434743527237
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 62460.748616666664
[INSERT], MinLatency(us), 17260
[INSERT], MaxLatency(us), 2341387
[INSERT], Return=0, 299993
[INSERT], 0, 207635.0
[INSERT], 1000, 79173.60651629073
[INSERT], 2000, 51913.05100182149
[INSERT], 3000, 44844.342606149345
[INSERT], 4000, 61279.99578059072
[INSERT], 5000, 79560.18867924529
[INSERT], 6000, 216034.88194444444
[INSERT], 7000, 93900.09463722397
[INSERT], 8000, 41808.27134986226
[INSERT], 9000, 45235.846737481035
[INSERT], 10000, 72896.13466334164
[INSERT], 11000, 85087.82608695653
[INSERT], 12000, 269130.3739837398
[INSERT], 13000, 112464.9966555184
[INSERT], 14000, 65079.10917030567
[INSERT], 15000, 75474.98488664988
[INSERT], 16000, 113267.52985074627
[INSERT], 17000, 145430.53170731707
[INSERT], 18000, 175779.11184210525
[INSERT], 19000, 135382.0329218107
[INSERT], 20000, 53777.71663619744
[INSERT], 21000, 64072.02528735632
[INSERT], 22000, 64721.80118110236
[INSERT], 23000, 78090.21246458923
[INSERT], 24000, 173515.13440860214
[INSERT], 25000, 52084.925531914894
[INSERT], 26000, 49618.69849246231
[INSERT], 27000, 60076.95841584158
[INSERT], 28000, 77799.63989637306
[INSERT], 29000, 94093.03726708074
[INSERT], 30000, 88892.77810650888
[INSERT], 31000, 64008.19957081545
[INSERT], 32000, 62042.81914893617
[INSERT], 33000, 124884.23360655738
[INSERT], 34000, 70631.61574074074
[INSERT], 35000, 92406.18770226538
[INSERT], 36000, 137138.5633802817
[INSERT], 37000, 200723.19736842104
[INSERT], 38000, 67950.54447439354
[INSERT], 39000, 110446.10429447853
[INSERT], 40000, 79659.80116959065
[INSERT], 41000, 135368.585106383
[INSERT], 42000, 244002.15789473685
[INSERT], 43000, 954153.25
[INSERT], 44000, 230369.8015873016
[INSERT], 45000, 127151.02118644067
[INSERT], 46000, 123205.578313253
[INSERT], 47000, 80815.0447368421
[INSERT], 48000, 194468.7142857143
[INSERT], 49000, 126638.70866141732
[INSERT], 50000, 183213.56593406593
[INSERT], 51000, 77497.67372881356
[INSERT], 52000, 125113.36697247706
[INSERT], 53000, 65749.39869281046
[INSERT], 54000, 55181.96635514019
[INSERT], 55000, 54692.71758436945
[INSERT], 56000, 60648.91701244813
[INSERT], 57000, 75400.97454545455
[INSERT], 58000, 86505.45572354212
[INSERT], 59000, 72420.40049140049
[INSERT], 60000, 58808.686
[INSERT], 61000, 84505.24645892352
[INSERT], 62000, 65218.97052631579
[INSERT], 63000, 60835.99393939394
[INSERT], 64000, 66126.33009708738
[INSERT], 65000, 125699.52243589744
[INSERT], 66000, 70904.60839160839
[INSERT], 67000, 55978.81732580037
[INSERT], 68000, 70529.85507246378
[INSERT], 69000, 70427.62972972973
[INSERT], 70000, 142853.69958847738
[INSERT], 71000, 52980.82884615385
[INSERT], 72000, 81074.06930693069
[INSERT], 73000, 61739.308333333334
[INSERT], 74000, 66933.73218673219
[INSERT], 75000, 62780.10658914729
[INSERT], 76000, 77565.50137741047
[INSERT], 77000, 146680.11926605506
[INSERT], 78000, 72353.05339805825
[INSERT], 79000, 72221.22931442081
[INSERT], 80000, 85793.63896848138
[INSERT], 81000, 54700.21256931608
[INSERT], 82000, 70153.13005780347
[INSERT], 83000, 111258.59485530546
[INSERT], 84000, 84463.25862068965
[INSERT], 85000, 80177.41017964072
[INSERT], 86000, 94609.28804347826
[INSERT], 87000, 104912.78985507246
[INSERT], 88000, 160297.27152317882
[INSERT], 89000, 567015.4603174604
[INSERT], 90000, 79013.67661691543
[INSERT], 91000, 50416.5618556701
[INSERT], 92000, 61931.95564516129
[INSERT], 93000, 76929.51923076923
[INSERT], 94000, 345653.84444444446
[INSERT], 95000, 374104.8494623656
[INSERT], 96000, 112120.27099236641
[INSERT], 97000, 90018.7921686747
[INSERT], 98000, 73181.83989501312
[INSERT], 99000, 69963.87710843373
[INSERT], 100000, 110737.35409836065
[INSERT], 101000, 78317.80322580645
[INSERT], 102000, 141378.3574297189
[INSERT], 103000, 63595.88045977012
[INSERT], 104000, 85211.80645161291
[INSERT], 105000, 148168.34433962265
[INSERT], 106000, 144553.72641509434
[INSERT], 107000, 64194.135802469136
[INSERT], 108000, 89815.27848101266
[INSERT], 109000, 68636.84334763949
[INSERT], 110000, 62908.558886509636
[INSERT], 111000, 62107.022448979595
[INSERT], 112000, 49507.80199667221
[INSERT], 113000, 68532.98829039812
[INSERT], 114000, 61385.24698795181
[INSERT], 115000, 50172.812395309884
[INSERT], 116000, 66973.81609195402
[INSERT], 117000, 186613.80246913582
[INSERT], 118000, 101292.36559139784
[INSERT], 119000, 80635.04271356783
[INSERT], 120000, 89348.32608695653
[INSERT], 121000, 102739.83294117647
[INSERT], 122000, 43650.2700729927
[INSERT], 123000, 195808.32258064515
[INSERT], 124000, 67421.20598006644
[INSERT], 125000, 110561.00282485876
[INSERT], 126000, 62207.129707112974
[INSERT], 127000, 56494.83047619047
[INSERT], 128000, 53446.91223404255
[INSERT], 129000, 74616.96564195298
[INSERT], 130000, 62895.583333333336
[INSERT], 131000, 47776.3482428115
[INSERT], 132000, 54741.699815837936
[INSERT], 133000, 83837.36312849162
[INSERT], 134000, 64482.90557939914
[INSERT], 135000, 53989.305653710246
[INSERT], 136000, 56505.126654064275
[INSERT], 137000, 53113.156305506214
[INSERT], 138000, 47054.09090909091
[INSERT], 139000, 65378.69395711501
[INSERT], 140000, 50716.46193771626
[INSERT], 141000, 54749.98120300752
[INSERT], 142000, 68250.87746170678
[INSERT], 143000, 50408.36363636364
[INSERT], 144000, 64211.81034482759
[INSERT], 145000, 49734.92739273927
[INSERT], 146000, 51448.25645438898
[INSERT], 147000, 63794.37606837607
[INSERT], 148000, 61105.26398210291
[INSERT], 149000, 72124.35344827586
[INSERT], 150000, 54172.20670391061
[INSERT], 151000, 49487.68292682927
[INSERT], 152000, 48266.4912836767
[INSERT], 153000, 48877.20036101083
[INSERT], 154000, 84298.18586387434
[INSERT], 155000, 105654.884
[INSERT], 156000, 54443.84491114701
[INSERT], 157000, 46948.427230046946
[INSERT], 158000, 58125.2427184466
[INSERT], 159000, 57808.120982986766
[INSERT], 160000, 63821.568181818184
[INSERT], 161000, 99696.30501089325
[INSERT], 162000, 78299.77551020408
[INSERT], 163000, 67604.11594202899
[INSERT], 164000, 51545.52144082333
[INSERT], 165000, 49749.44918032787
[INSERT], 166000, 54863.83546617916
[INSERT], 167000, 55829.96428571428
[INSERT], 168000, 61837.468041237116
[INSERT], 169000, 63216.1906779661
[INSERT], 170000, 47620.07389937107
[INSERT], 171000, 45420.36555891239
[INSERT], 172000, 45317.15460526316
[INSERT], 173000, 55471.68793103448
[INSERT], 174000, 49933.15983606558
[INSERT], 175000, 58044.5
[INSERT], 176000, 48920.0736
[INSERT], 177000, 52556.661458333336
[INSERT], 178000, 52273.28725314183
[INSERT], 179000, 46324.33606557377
[INSERT], 180000, 56871.12296564195
[INSERT], 181000, 67778.67028199566
[INSERT], 182000, 70640.38970588235
[INSERT], 183000, 61808.02448979592
[INSERT], 184000, 72815.88188976378
[INSERT], 185000, 66221.13836477988
[INSERT], 186000, 67262.86710239651
[INSERT], 187000, 64948.536016949154
[INSERT], 188000, 56472.90114068441
[INSERT], 189000, 382718.95081967214
[INSERT], 190000, 70711.46449136277
[INSERT], 191000, 58274.096837944664
[INSERT], 192000, 51188.87244897959
[INSERT], 193000, 98154.3431372549
[INSERT], 194000, 55532.39154411765
[INSERT], 195000, 44145.16615853659
[INSERT], 196000, 57720.72348484849
[INSERT], 197000, 71518.22355769231
[INSERT], 198000, 62760.9083503055
[INSERT], 199000, 50297.535496957404
[INSERT], 200000, 68558.68209255533
[INSERT], 201000, 49315.02547770701
[INSERT], 202000, 45594.6641337386
[INSERT], 203000, 60158.43927125506
[INSERT], 204000, 53191.498207885306
[INSERT], 205000, 49444.839869281044
[INSERT], 206000, 76213.3023872679
[INSERT], 207000, 52612.125636672325
[INSERT], 208000, 55874.15939278938
[INSERT], 209000, 102037.23606557377
[INSERT], 210000, 58172.5477582846
[INSERT], 211000, 61331.125
[INSERT], 212000, 57829.04406130268
[INSERT], 213000, 59392.47094188377
[INSERT], 214000, 80392.30133333334
[INSERT], 215000, 50803.902896081774
[INSERT], 216000, 50131.19420783646
[INSERT], 217000, 63784.30101010101
[INSERT], 218000, 53574.45585585586
[INSERT], 219000, 59400.250505050506
[INSERT], 220000, 80691.65582655827
[INSERT], 221000, 87165.5335276968
[INSERT], 222000, 106508.75636363636
[INSERT], 223000, 74428.51327433628
[INSERT], 224000, 128482.65895953757
[INSERT], 225000, 201287.698630137
[INSERT], 226000, 52193.212014134275
[INSERT], 227000, 57023.961977186314
[INSERT], 228000, 74064.56140350878
[INSERT], 229000, 74002.66262135922
[INSERT], 230000, 61745.23138832998
[INSERT], 231000, 49920.76222596964
[INSERT], 232000, 48320.34380165289
[INSERT], 233000, 60680.69898989899
[INSERT], 234000, 61649.75403225807
[INSERT], 235000, 44826.66063348416
[INSERT], 236000, 70417.64593301436
[INSERT], 237000, 57034.531135531135
[INSERT], 238000, 50448.39460370995
[INSERT], 239000, 50154.760344827584
[INSERT], 240000, 59591.32064128257
[INSERT], 241000, 48286.05882352941
[INSERT], 242000, 59558.70916334661
[INSERT], 243000, 51267.852173913045
[INSERT], 244000, 50227.898897058825
[INSERT], 245000, 75199.31972789115
[INSERT], 246000, 50442.97079037801
[INSERT], 247000, 59715.77976190476
[INSERT], 248000, 49938.83388704319
[INSERT], 249000, 38920.35584415584
[INSERT], 250000, 114378.05952380953
[INSERT], 251000, 44520.49506346967
[INSERT], 252000, 53587.0195035461
[INSERT], 253000, 45655.5046875
[INSERT], 254000, 43854.40350877193
[INSERT], 255000, 90309.75452716298
[INSERT], 256000, 43945.671575846834
[INSERT], 257000, 48843.99520766773
[INSERT], 258000, 46061.87901990812
[INSERT], 259000, 67810.71494252874
[INSERT], 260000, 80128.83155080213
[INSERT], 261000, 46053.04923076923
[INSERT], 262000, 61998.319755600816
[INSERT], 263000, 54694.92407407407
[INSERT], 264000, 50733.18518518518
[INSERT], 265000, 52604.08904109589
[INSERT], 266000, 62317.50099800399
[INSERT], 267000, 58989.02385685885
[INSERT], 268000, 45909.9525065963
[INSERT], 269000, 73149.1703958692
[INSERT], 270000, 52507.58159722222
[INSERT], 271000, 58280.7996031746
[INSERT], 272000, 43864.5
[INSERT], 273000, 64446.9577167019
[INSERT], 274000, 46815.16427432217
[INSERT], 275000, 79318.33333333333
[INSERT], 276000, 54150.028169014084
[INSERT], 277000, 38471.2
[INSERT], 278000, 64920.120762711864
[INSERT], 279000, 45375.50309597523
[INSERT], 280000, 86585.7793696275
[INSERT], 281000, 106793.79370629371
[INSERT], 282000, 47303.26475279107
[INSERT], 283000, 82920.94812680116
[INSERT], 284000, 68804.74776785714
[INSERT], 285000, 141426.74647887325
[INSERT], 286000, 90386.86607142857
[INSERT], 287000, 45497.845679012345
[INSERT], 288000, 45380.002962962964
[INSERT], 289000, 40069.955862068964
[INSERT], 290000, 41644.96542185339
[INSERT], 291000, 51965.53231292517
[INSERT], 292000, 51824.318493150684
[INSERT], 293000, 48464.434571890146
[INSERT], 294000, 42500.41726618705
[INSERT], 295000, 66352.39159292035
[INSERT], 296000, 46711.862068965514
[INSERT], 297000, 45222.45962732919
[INSERT], 298000, 55386.86379928316
[INSERT], 299000, 67765.63425925926
[INSERT], 300000, 48749.455555555556
[INSERT], 301000, 52705.94513274336
[INSERT], 302000, 56390.00187617261
[INSERT], 303000, 45152.03625377644
[INSERT], 304000, 54304.55160142349
[INSERT], 305000, 53051.924324324325
[INSERT], 306000, 62441.13043478261
[INSERT], 307000, 68526.0275862069
[INSERT], 308000, 52400.21328671329
[INSERT], 309000, 51177.483979763914
[INSERT], 310000, 165998.2625698324
[INSERT], 311000, 41158.655359565804
[INSERT], 312000, 85300.81962025317
[INSERT], 313000, 47393.52958152958
[INSERT], 314000, 46671.881002087684
[INSERT], 315000, 307504.6666666667
[INSERT], 316000, 107864.07189542483
[INSERT], 317000, 70761.71889400922
[INSERT], 318000, 45480.265957446805
[INSERT], 319000, 44991.49338374291
[INSERT], 320000, 76683.23554603854
[INSERT], 321000, 41438.06594885599
[INSERT], 322000, 60871.58215010142
[INSERT], 323000, 48305.90746753247
[INSERT], 324000, 48930.80586080586
[INSERT], 325000, 78691.00968523002
[INSERT], 326000, 49089.43225806452
[INSERT], 327000, 57502.43792325057
[INSERT], 328000, 54557.87321711569
[INSERT], 329000, 41882.62222222222
[INSERT], 330000, 55932.89097744361
[INSERT], 331000, 40187.4268125855
[INSERT], 332000, 51960.546689303905
[INSERT], 333000, 110343.69064748201
[INSERT], 334000, 44333.4009009009
[INSERT], 335000, 46301.10413476263
[INSERT], 336000, 40086.92204301075
[INSERT], 337000, 76269.39540816327
[INSERT], 338000, 75461.65662650602
[INSERT], 339000, 75258.53930131004
[INSERT], 340000, 54830.64087301587
[INSERT], 341000, 85597.11375661376
[INSERT], 342000, 49385.41396508728
[INSERT], 344000, 134732.78420038536
[INSERT], 345000, 55019.37246963563
[INSERT], 346000, 71973.8688172043
[INSERT], 347000, 46096.90015600624
[INSERT], 348000, 46063.76646706587
[INSERT], 349000, 61669.036402569596
[INSERT], 350000, 83801.55524861878
[INSERT], 351000, 68341.80995475114
[INSERT], 352000, 42842.148843930634
[INSERT], 353000, 60197.81606765328
[INSERT], 354000, 68532.95931477516
[INSERT], 355000, 51510.656140350875
[INSERT], 356000, 51127.29679595278
[INSERT], 357000, 49567.34951456311
[INSERT], 358000, 59794.72895277207
[INSERT], 359000, 50458.43001686341
[INSERT], 360000, 46802.76783004552
[INSERT], 361000, 48691.46091205212
[INSERT], 362000, 43488.86969253294
[INSERT], 363000, 54985.65094339623
[INSERT], 364000, 65293.40251572327
[INSERT], 365000, 47055.40996784566
[INSERT], 366000, 54160.80535714285
[INSERT], 367000, 33576.06160616061
[INSERT], 368000, 45074.23466257669
[INSERT], 369000, 57638.26162790698
[INSERT], 370000, 134533.55980861245
[INSERT], 371000, 113504.39607843137
[INSERT], 372000, 60606.73381294964
[INSERT], 373000, 50558.907251264754
[INSERT], 374000, 66105.43111111112
[INSERT], 375000, 42542.77510608204
[INSERT], 376000, 43692.42402315485
[INSERT], 377000, 53051.47491039427
[INSERT], 378000, 52267.574137931035
[INSERT], 379000, 86626.66376811595
[INSERT], 380000, 55927.44871794872
[INSERT], 381000, 287963.9894179894
[INSERT], 382000, 54041.55202821869
[INSERT], 383000, 50668.3282571912
[INSERT], 384000, 51313.55084745763
[INSERT], 385000, 77575.05729166667
[INSERT], 386000, 57150.51711026616
[INSERT], 387000, 45820.62232415902
[INSERT], 388000, 49611.72123176661
[INSERT], 389000, 46413.20911949685
[INSERT], 390000, 54494.99453551912
[INSERT], 391000, 55519.22222222222
[INSERT], 392000, 46426.25636942675
[INSERT], 393000, 51853.754385964916
[INSERT], 394000, 47562.617021276594
[INSERT], 395000, 70276.8726899384
[INSERT], 396000, 53324.39344262295
[INSERT], 397000, 52493.5296108291
[INSERT], 398000, 51456.749116607774
[INSERT], 399000, 54691.59536541889
[INSERT], 400000, 192478.58823529413
[INSERT], 401000, 41483.81069958848
[INSERT], 402000, 46161.68067226891
[INSERT], 403000, 65500.792607802876
[INSERT], 404000, 57841.982954545456
[INSERT], 405000, 51662.336177474404
[INSERT], 406000, 95088.11254019293
[INSERT], 407000, 42567.51506024096
[INSERT], 408000, 47245.005856515374
[INSERT], 409000, 45035.02147239264
[INSERT], 410000, 105292.01086956522
[INSERT], 411000, 65367.79449152543
[INSERT], 412000, 45410.67380560132
[INSERT], 413000, 52280.006410256414
[INSERT], 414000, 45464.73466257669
[INSERT], 415000, 70203.78082191781
[INSERT], 416000, 66140.4845814978
[INSERT], 417000, 52805.305114638446
[INSERT], 418000, 83861.4161849711
[INSERT], 419000, 40735.62016574586
[INSERT], 420000, 53775.83882149047
[INSERT], 421000, 51834.68166089965
[INSERT], 422000, 38314.81876606684
[INSERT], 423000, 40584.867647058825
[INSERT], 424000, 46275.8234375
[INSERT], 425000, 65155.3982869379
[INSERT], 426000, 64228.05721393035
[INSERT], 427000, 62193.70848708487
[INSERT], 428000, 55884.5417515275
[INSERT], 429000, 54121.14882943144
[INSERT], 430000, 45553.736131934034
[INSERT], 431000, 42102.947723440135
[INSERT], 432000, 63662.315884476535
[INSERT], 433000, 41538.552486187844
[INSERT], 434000, 51731.86826347305
[INSERT], 435000, 273748.43089430896
[INSERT], 436000, 64810.26291079812
[INSERT], 437000, 82315.43181818182
[INSERT], 438000, 46566.952681388015
[INSERT], 439000, 47107.65244865719
[INSERT], 440000, 50847.44891122278
[INSERT], 441000, 50023.141903171956
[INSERT], 442000, 81802.89531680441
[INSERT], 443000, 50143.691803278685
[INSERT], 444000, 59354.24203821656
[INSERT], 445000, 119844.78544061302
[INSERT], 446000, 72695.45647058824
[INSERT], 447000, 57162.0
[INSERT], 448000, 52852.188481675395
[INSERT], 449000, 75069.69705882353
[INSERT], 450000, 347375.64835164836
[INSERT], 451000, 443465.5573770492
[INSERT], 452000, 367145.8202247191
[INSERT], 453000, 125116.89583333333
[INSERT], 454000, 63088.23846153846
[INSERT], 455000, 123376.61538461539
[INSERT], 456000, 43604.68501529052
[INSERT], 457000, 62331.15151515151
[INSERT], 458000, 65469.513184584175
[INSERT], 459000, 46824.76404494382
[INSERT], 460000, 56865.510280373834
[INSERT], 461000, 40144.7
[INSERT], 462000, 54269.302867383514
[INSERT], 463000, 514857.3870967742
[INSERT], 464000, 123991.38309859156
[INSERT], 465000, 43882.40241448692
[INSERT], 466000, 80869.53404255319
[INSERT], 467000, 50070.896147403684
[INSERT], 468000, 54402.339928057554
[INSERT], 469000, 59531.73333333333
[INSERT], 470000, 52159.11623931624
[INSERT], 471000, 55484.63108614232
[INSERT], 472000, 57860.013333333336
[INSERT], 473000, 43689.88505747126
[INSERT], 474000, 121307.34008097165
[INSERT], 475000, 65531.80893300248
[INSERT], 476000, 57237.04049295775
[INSERT], 477000, 49281.352348993285
[INSERT], 478000, 60017.163742690056
[INSERT], 479000, 68743.00688073394
[INSERT], 480000, 48840.72435897436
[INSERT], 481000, 39686.88104575164
[INSERT], 482000, 40382.14819944598
[INSERT], 483000, 56145.25563909775
[INSERT], 484000, 74731.40487804878
[INSERT], 485000, 54400.56306306306
[INSERT], 486000, 63189.10053859964
[INSERT], 487000, 39551.132894736846
[INSERT], 488000, 55036.10147601476
[INSERT], 489000, 55103.09498207885
[INSERT], 490000, 60287.04301075269
[INSERT], 491000, 59182.662213740456
[INSERT], 492000, 43243.72662889519
[INSERT], 493000, 46190.655384615384
[INSERT], 494000, 54581.50448833034
[INSERT], 495000, 50010.09491525424
[INSERT], 496000, 87819.82417582418
[INSERT], 497000, 811730.9047619047
[INSERT], 498000, 45237.85861561119
[INSERT], 499000, 61294.06693711968
[INSERT], 500000, 58518.87624750499
[INSERT], 501000, 59499.94117647059
[INSERT], 502000, 41871.959833795016
[INSERT], 503000, 49793.89090909091
[INSERT], 504000, 62241.49163179917
[INSERT], 505000, 70872.67757009345
[INSERT], 506000, 80370.0241935484
[INSERT], 508000, 212501.9438502674
[INSERT], 509000, 53222.50091743119
[INSERT], 510000, 73750.63529411764
[INSERT], 511000, 55521.92599620493
[INSERT], 512000, 40595.33112582781
[INSERT], 513000, 49562.07060755337
[INSERT], 514000, 49946.68096054888
[INSERT], 515000, 94508.10884353741
[INSERT], 516000, 97136.66076696165
[INSERT], 517000, 48593.48590381426
[INSERT], 518000, 45227.81277860327
[INSERT], 519000, 54718.68115942029
[INSERT], 520000, 49333.16887417219
[INSERT], 521000, 59629.324055666
[INSERT], 522000, 54357.44285714286
[INSERT], 523000, 45444.27659574468
[INSERT], 524000, 47442.36363636364
[INSERT], 525000, 64109.18584070796
[INSERT], 526000, 134570.82790697674
[INSERT], 527000, 96264.8640776699
[INSERT], 528000, 61169.78170478171
[INSERT], 529000, 91508.3343373494
[INSERT], 530000, 54094.25890736342
[INSERT], 531000, 93102.77386934674
[INSERT], 532000, 49158.23824959481
[INSERT], 533000, 59212.4135021097
[INSERT], 534000, 46533.08797653959
[INSERT], 535000, 51055.20981387479
[INSERT], 536000, 91013.23202614379
[INSERT], 537000, 128537.73684210527
[INSERT], 538000, 56603.70676691729
[INSERT], 539000, 57974.61849710983
[INSERT], 540000, 53326.77877697842
[INSERT], 541000, 54165.63401109057
[INSERT], 542000, 88157.5590778098
[INSERT], 543000, 54211.37251356239
[INSERT], 544000, 49656.01388888889
[INSERT], 545000, 52221.74834437086
[INSERT], 546000, 53288.96715328467
[INSERT], 547000, 67114.46244131455
[INSERT], 548000, 66717.77684210526
[INSERT], 549000, 51297.11952861953
[INSERT], 550000, 43762.99403874814
[INSERT], 551000, 44912.72780203784
[INSERT], 552000, 80038.08152173914
[INSERT], 553000, 60509.44646464646
[INSERT], 554000, 42172.3228021978
[INSERT], 555000, 43603.609144542774
[INSERT], 556000, 56267.59251968504
[INSERT], 557000, 84088.14426229509
[INSERT], 558000, 482941.75757575757
[INSERT], 559000, 88693.2579787234
[INSERT], 560000, 45892.13567073171
[INSERT], 561000, 42152.961656441716
[INSERT], 562000, 54102.92549668874
[INSERT], 563000, 42822.803646563814
[INSERT], 564000, 40461.85537190083
[INSERT], 565000, 50420.67610619469
[INSERT], 566000, 45514.17612809316
[INSERT], 567000, 83542.66016713092
[INSERT], 568000, 48290.365659777424
[INSERT], 569000, 46831.18309859155
[INSERT], 570000, 53938.94661921708
[INSERT], 571000, 56307.08235294118
[INSERT], 572000, 113955.93726937269
[INSERT], 573000, 51309.2717948718
[INSERT], 574000, 48410.6976
[INSERT], 575000, 46193.84433962264
[INSERT], 576000, 61685.118712273645
[INSERT], 577000, 117005.27604166667
[INSERT], 578000, 98028.96010638298
[INSERT], 579000, 47812.05039370079
[INSERT], 580000, 44332.55720653789
[INSERT], 581000, 46212.91981845688
[INSERT], 582000, 66266.75057208238
[INSERT], 583000, 56631.37701612903
[INSERT], 584000, 66769.34016393442
[INSERT], 585000, 50372.07321131448
[INSERT], 586000, 45798.90166414523
[INSERT], 587000, 61086.727688787185
[INSERT], 588000, 270585.5714285714
[INSERT], 589000, 347282.2643678161
[INSERT], 590000, 62729.816700611
[INSERT], 591000, 51083.89278752437
[INSERT], 592000, 69281.83474576271
[INSERT], 593000, 46925.73303167421
[INSERT], 594000, 62427.6835443038
[INSERT], 595000, 70072.21040189125
[INSERT], 596000, 50140.43449419569
[INSERT], 597000, 63604.031602708805
[INSERT], 598000, 117541.63841807909
[INSERT], 599000, 101788.89578163772
[INSERT], 600000, 52185.26102292769
[INSERT], 601000, 49866.07026143791
[INSERT], 602000, 90514.53333333334
[INSERT], 603000, 84582.49447513813
[INSERT], 604000, 52334.987931034484
[INSERT], 605000, 53352.232974910396
[INSERT], 606000, 61107.54527162978
[INSERT], 607000, 61287.907756813416
[INSERT], 608000, 55159.494505494506
[INSERT], 609000, 68581.5175
[INSERT], 610000, 58281.91592128801
[INSERT], 611000, 57394.44696969697
[INSERT], 612000, 50183.01507537688
[INSERT], 613000, 69050.9425
[INSERT], 614000, 52398.790352504635
[INSERT], 615000, 54850.397660818715
[INSERT], 616000, 43860.0652866242
[INSERT], 617000, 42495.084592145016
[INSERT], 618000, 54493.64255319149
[INSERT], 619000, 83299.55390334573
[INSERT], 620000, 95681.72489082969
[INSERT], 621000, 145179.3305785124
[INSERT], 622000, 408437.0
[INSERT], 623000, 248319.3798076923
[INSERT], 624000, 54208.400921658984
[INSERT], 625000, 41511.14928909953
[INSERT], 626000, 51976.80586080586
[INSERT], 627000, 31932.36085626911
[INSERT], 628000, 32971.5445026178
[INSERT], 629000, 32905.0
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 322.6
[CLEANUP], MinLatency(us), 131
[CLEANUP], MaxLatency(us), 1788
[CLEANUP], 0, 1003.5
[CLEANUP], 4000, 215.0
[CLEANUP], 6000, 326.0
[CLEANUP], 7000, 170.0
[CLEANUP], 8000, 396.0
[CLEANUP], 11000, 217.0
[CLEANUP], 12000, 229.0
[CLEANUP], 13000, 184.5
[CLEANUP], 14000, 564.75
[CLEANUP], 15000, 197.66666666666666
[CLEANUP], 16000, 205.42857142857142
java -cp /root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/jdbc/target/jdbc-binding-0.1.4.jar:/root/ycsb/YCSB/jdbc/target/archive-tmp/jdbc-binding-0.1.4.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P /root/ycsb/config/postgresql.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load